[
    {
        "id": "tao-future-of-mathematics",
        "kind": "video",
        "title": "Terry Tao on the Future of Mathematics",
        "blurb": "Interview where Terence Tao shares views on how mathematical research may evolve and how mathematicians might work in the future.",
        "url": "https://www.youtube.com/watch?v=4ykbHwZQ8iU",
        "tags": [
            "interview",
            "research-culture"
        ]
    },
    {
        "id": "finding-grothendieck-documentary",
        "kind": "video",
        "title": "A Documentary on Finding Grothendieck",
        "blurb": "A documentary-style video about people searching for Alexander Grothendieck after he withdrew from public life.",
        "url": "https://www.youtube.com/watch?v=sGzVHQniIiE",
        "tags": [
            "history",
            "biography",
            "research-culture"
        ]
    },
    {
        "id": "williamson-neural-networks-discovery",
        "kind": "video",
        "title": "Geordie Williamson: Neural Networks for Mathematical Discovery",
        "blurb": "Talk on using neural networks as tools that can assist or inspire mathematical discovery.",
        "url": "https://www.youtube.com/watch?v=Uxr_HrbN1MQ",
        "tags": [
            "ai",
            "ml",
            "mathematical-discovery"
        ]
    },
    {
        "id": "quanta-beauty-truth-proof-ai",
        "kind": "article",
        "title": "Mathematical Beauty, Truth and Proof in the Age of AI (Quanta)",
        "blurb": "Quanta Magazine article discussing how AI affects notions of proof, understanding, and mathematical aesthetics.",
        "url": "https://www.quantamagazine.org/mathematical-beauty-truth-and-proof-in-the-age-of-ai-20250430/",
        "tags": [
            "ai",
            "proof",
            "philosophy"
        ]
    },
    {
        "id": "tao-mathstodon-115385022005130505",
        "kind": "social",
        "title": "Terry Tao on AI Accelerating Mundane Mathematical Tasks",
        "blurb": "Terence Tao argues that AI's greatest near-term mathematical impact will come from accelerating mundane tasks like literature reviews—already demonstrated on the Erdos Problems website, where AI-assisted searches recently reclassified six open problems as solved by uncovering obscure papers.",
        "url": "https://mathstodon.xyz/@tao/115385022005130505",
        "tags": [
            "social"
        ]
    },
    {
        "id": "tao-mathstodon-115722360006034040",
        "kind": "social",
        "title": "Terry Tao about Artificial General Cleverness",
        "blurb": "Terence Tao argues that while true artificial general intelligence remains elusive, we're witnessing the rise of \"artificial general cleverness\"—AI systems that can solve complex problems through brute force and pattern-matching rather than genuine understanding",
        "url": "https://mathstodon.xyz/@tao/115722360006034040",
        "tags": [
            "social"
        ]
    },
    {
        "id": "social-proof-how-mathematical-practice-is-evolving",
        "kind": "article",
        "title": "The Social Proof: How Mathematical Practice is Evolving",
        "blurb": "Interviewing thirty mathematicians exposes a gap between AI hype and research reality: while headlines tout superhuman theorem-proving, working mathematicians quietly use AI for tedious tasks like searching obscure papers or proving small technical lemmas.",
        "url": "https://dsleo.github.io/maths/2025/12/12/mathematicians-future.html",
        "tags": [
            "ai",
            "research-culture",
            "tools"
        ]
    },
    {
        "id": "buzzard-formal-or-not-formal-ai-theorem-proving",
        "kind": "article",
        "title": "Formal or Not Formal? That Is the Question in AI for Theorem Proving",
        "blurb": "Kevin Buzzard discusses the strategic and philosophical trade-offs between formal and informal mathematics in the context of AI-assisted theorem proving, drawing on experiences from the Lean community and the Xena Project.",
        "url": "https://xenaproject.wordpress.com/2025/10/22/formal-or-not-formal-that-is-the-question-in-ai-for-theorem-proving/",
        "tags": [
            "ai",
            "formal-methods",
            "theorem-proving"
        ]
    },
    {
        "id": "gowers-x-1984340182351634571",
        "kind": "social",
        "title": "Timothy Gowers on AI and Mathematical Research",
        "blurb": "Timothy Gowers reflects on the realistic capabilities and limitations of current AI systems in mathematics, emphasizing where automation may genuinely assist research versus where human insight remains essential.",
        "url": "https://x.com/wtgowers/status/1984340182351634571",
        "tags": [
            "social",
            "ai",
            "research-culture"
        ]
    },
    {
        "id": "riehl-proof-assistants-mathematical-understanding",
        "kind": "video",
        "title": "Emily Riehl on Proof Assistants and Mathematical Understanding",
        "blurb": "Emily Riehl reflects on the relationship between proof assistants and human mathematical understanding, arguing that formalization can enhance, but not replace, conceptual clarity.",
        "url": "https://youtu.be/fzxW2XJS6SE",
        "tags": [
            "formalization",
            "research-culture",
            "talk"
        ]
    }
]